// Pmac.h : header file
//
#pragma once
#include <afxctl.h>

#define VR_PMAC_SENDLINE 0xB0
#define VR_PMAC_GETLINE 0xB1
#define VR_PMAC_FLUSH 0xB3
#define VR_PMAC_GETMEM 0xB4
#define VR_PMAC_SETMEM 0xB5
#define VR_PMAC_SETBIT 0xBA
#define VR_PMAC_SETBITS 0xBB
#define VR_PMAC_PORT 0xBE
#define VR_PMAC_GETRESPONSE 0xBF
#define VR_PMAC_READREADY 0xC2
#define VR_CTRL_RESPONSE 0xC4
#define VR_PMAC_GETBUFFER 0xC5
#define VR_PMAC_WRITEBUFFER 0xC6
#define VR_PMAC_WRITEERROR 0xC7
#define VR_FWDOWNLOAD 0xCB
#define VR_IPADDRESS 0xE0
#define VR_DOWNLOAD  0x40
#define VR_UPLOAD     0xC0
#define ETHERNETCMDSIZE 8
#define DPR_OFFSET_MOTORBITS     112

// SERVO STATUS
// Motor Servo Status ( ? 1st 24 bit word )
typedef union tagSERVOSTATUS
{
	_int32 StatusWord;
	struct {
	USHORT rapid_spd_sel : 1; // B00 - RAPID MOVE SPEED SELECT (IXX90)
	USHORT dac_sign_mag : 1; // B01 - SIGN/MAGNITUDE SERVO (IXX96)
	USHORT sw_capture : 1; // B02 - SOFTWARE HOME CAPTURE (IXX97.0)
	USHORT fe_capture : 1; // B03 - CAPTURE ON FOLLOWING ERROR (IXX97.1)
	USHORT handwheel_ena : 1; // B04 - HANDWHEEL ENABLE FLAG (IXX06.0)
	USHORT hw_mode : 1; // B05 - HANDWHEEL MODE FLAG (IXX06.1)
	USHORT phased_motor : 1; // B06 - PHASED MOTOR ENABLE FLAG (IXX01.0)
	USHORT yenc_phase : 1; // B07 - Y PHASE ENCODER (IXX01.1)
	USHORT user_servo : 1; // B08 - USER WRITEN SERVO ENABLE (IXX59.0)
	USHORT user_phase : 1; // B09 - USER WRITEN PHASE ENABLE (IXX59.1)
	USHORT home_search : 1; // B10 - HOME IN PROGRESS FLAG
	USHORT block_request : 1; // B11 - BLOCK REQUEST FLAG
	USHORT limit_stop : 1; // B12 - Limit Stop Flag
	USHORT desired_vel_0 : 1; // B13 - Desired Velocity = 0
	USHORT data_block_err : 1; // B14 - DATA BLOCK ERROR
	USHORT dwelling : 1; // B15 - Dwell Mode
	USHORT integrator_ena : 1; // B16 - Ixx34
	USHORT run_program : 1; // B17 - MOVE TIMER ACTIVE
	USHORT open_loop : 1; // B18 - OPEN LOOP MODE
	USHORT amp_enabled : 1; // B19 - AMPLIFIER ENABLED FLAG
	USHORT algo_ena : 1; // B20 - EXTENDED ALGO ENABLE FLAG (I3300+50*N)
	USHORT pos_limit : 1; // B21 - POSITIVE POSITION LIMIT
	USHORT neg_limit : 1; // B22 - NEGATIVE POSITION LIMIT
	USHORT activated : 1; // B23 - Ixx00
	USHORT pads : 8; // B24..31 - Not Available
	}Bits;
} SERVOSTATUS;

// MOTOR STATUS
// Motor Status ( ? 2nd 24 bit word )
typedef union tagMOTORSTATUS
{
	_int32 StatusWord;
	struct {
	USHORT in_position : 1; // B00 - IN POSITION
	USHORT warn_ferr : 1; // B01 - SOFT FOLLOWING ERROR
	USHORT fatal_ferr : 1; // B02 - FATAL FOLLOWING ERROR
	USHORT amp_fault : 1; // B03 - AMP FAULT ERROR
	USHORT backlash_dir : 1; // B04 - BACKLASH DIRECTION FLAG
	USHORT amp_i2t_err : 1; // B05 - I2T AMP FAULT
	USHORT integral_ferr : 1; // B06 - INTEGRATED FOLLOWING ERROR FAULT
	USHORT triger_home_flg : 1; // B07 - TRIGGER/HOME MOVE FLAG
	USHORT phase_find_err : 1; // B08 - PHASE FINDING ERROR FLAG
	USHORT tbd09 : 1; // B09 - TBD
	USHORT home_complete : 1; // B10 - HOME COMPLETE FLAG
	USHORT stopped_on_limit : 1; // B11 - POS LIMIT STOP FLAG
	USHORT: 1; // B12 - TBD
	USHORT reset_phase_error : 1; // B13 - TBD
	USHORT encoder_count_error : 1; // B14 - TBD
	USHORT cs_assigned : 1; // B15 - TBD
	USHORT cs_def : 4; // B16..19 - Coord. Sys. Axis Def
	USHORT coord_sys : 4; // B20..23 - MOTOR COORDINATE SYSTEM NUMBER (-1)
	USHORT padm : 8; // B24..31 - Not Available	
	}Bits;
} MOTORSTATUS;

// MOTOR STATUS
// Motor Status ( ? 2nd 24 bit word )
//typedef union tagMOTORSTATUS
//{
//	_int32 StatusWord;
//	struct {
//	USHORT in_position : 1; // B00 - IN POSITION
//	USHORT warn_ferr : 1; // B01 - SOFT FOLLOWING ERROR
//	USHORT fatal_ferr : 1; // B02 - FATAL FOLLOWING ERROR
//	USHORT amp_fault : 1; // B03 - AMP FAULT ERROR
//	USHORT backlash_dir : 1; // B04 - BACKLASH DIRECTION FLAG
//	USHORT amp_i2t_err : 1; // B05 - I2T AMP FAULT
//	USHORT integral_ferr : 1; // B06 - INTEGRATED FOLLOWING ERROR FAULT
//	USHORT triger_home_flg : 1; // B07 - TRIGGER/HOME MOVE FLAG
//	USHORT phase_find_err : 1; // B08 - PHASE FINDING ERROR FLAG
//	USHORT tbd09 : 1; // B09 - TBD
//	USHORT home_complete : 1; // B10 - HOME COMPLETE FLAG
